cool/tutorials/incompressible/icoDyMFoam/movingBlockRBF/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    block
    {
        type            wall;
        nFaces          12;
        startFace       1184;
    }
    top
    {
        type            wall;
        nFaces          25;
        startFace       1196;
    }
    bottom
    {
        type            wall;
        nFaces          25;
        startFace       1221;
    }
    left
    {
        type            wall;
        nFaces          25;
        startFace       1246;
    }
    right
    {
        type            wall;
        nFaces          25;
        startFace       1271;
    }
    frontAndBack
    {
        type            empty;
        nFaces          1240;
        startFace       1296;
    }
)

// ************************************************************************* //
